Layout
A - B - C - D - E - G - H - I - P - S - T - U

A
Additional cess - Cess in general refers to a tax that is levied on top of another tax. They are usually earmarked for a specific purpose. Under the GST regime, an additional cess will levied upon certain goods for the first five years post GST roll out, in order to compensate for any loss of revenue borne by the State government that may arise due to the uniformization and reduction of tax rates associated with demerit goods under the GST.

Aggregate Turnover - Aggregate Turnover is the aggregate value of all sales, supply and export of goods and/or services (both taxable and non-taxable) by a person (with a PAN) excluding taxes.

B
B to B - Any sale or purchase is deemed as a B to B (Business to Business) transaction when it is carried out between two or more registered persons.

B to C - Any sale os purchase is deemed as a B to C (Business to Consumer) transaction when it is carried out between a registered person and one or more unregistered persons.

C
Capital goods - Capital Goods are items which are purchased and used for doing/developing a business (for sale/to generate income). It also includes those items for which a taxpayer has claimed input tax credit.

Cash ledger - A cash ledger is one of the subsidiary ledgers that are maintained by a company alongside the general ledger. As the name says ‘cash’, this ledger is a record of all transactions associated to cash accounts that are operated by an organization and its branches.

CGST - The GST levied on an intra-state (same state) transaction has two components - CGST and SGST. The CGST or the Central Goods and Services Tax is the central component of GST that subsumes all indirect taxes collected by the centre (e.g.: CED, ST, etc.). The tax collected under this component becomes the revenue for the central government.

CPI - The CPI or the Consumer Price Index is a method of estimating the changes in the prices of a basket of goods or a bundle of services that represent the consumption expenditure in an economy. It is based on the weighted average method of costing and is primarily used to calculate the inflation in an economy.

D
Demerit goods - A demerit good is an item or service whose consumption is considered unhealthy, degrading, or otherwise socially undesirable due to the perceived negative effects on the consumers themselves. E.g.: Tobacco based products.

DSC - DSC or Digital Signature Certificate is an electronic document or key that identifies a person who is buying or selling items or services online. This digitally encrypted document is issued by a certifying authority and contains the personal details and credentials of an individual or a designated signatory of a company. This key is also used to validate and establish the credentials of a taxpayer while filing GST returns.

E
E-commerce operator - Under the GST, this term refers businesses that offer an online marketplace where other vendors can sell goods to customers. E.g.: Flipkart, Amazon, etc.

E-sign - E-sign or Electronic Signature is an online electronic service which allows a GST registered taxpayer/Aadhar holder to digitally sign a document. This can be configured inside the GST portal during the registration process.

G
GSTIN - GSTIN or the Goods and Services Taxpayer Identification Number is a unique PAN-based 15-digit number given to a taxpayer registered under the GST law. (A taxpayer will have to register for the GST across all the states where they have a branch of their organization, and the GSTIN will vary from state to state even if the PAN is the same.)

GSTN - GSTN stands for the Goods and Services Tax Network. It is a non-profit, non-government private limited company that will provide IT infrastructure and services to the Central and State Governments, tax payers and other stakeholders for implementation of the Goods and Services Tax (GST).

H
HSN code - The Harmonized System of Nomenclature (HSN) is an internationally accepted method of naming, classifying and identifying products; each identified by a 2-8 digit code (depending on your aggregate turnover - 1.5 crores (2 digits), 5 crores(4 digits) or more and sourcing method - local(2-4 digits) or imports(8 digits)), arranged in a legal and logical structure and governed by specific rules.
I
IGST - The IGST or the Integrated Goods and Services Tax will apply to all interstate state transactions. It will be uniform across all the states and is expected to be applicable to all forms of supply - be it sale, stock transfer or import of goods. The revenue earned under the IGST will be split between the central government and the destination state.

ISD - ISD stands for Input Service Distributors. An Input Service Distributor is an intermediary or an office which manages the business of a manufacturer or producer of final products or output service provider (e.g.: The corporate office of a Pizza chain). ISDs receive vendor bills on behalf of their branches and issue invoices to the manufacturer/branches in-order to distribute the Input Tax Credits.

ITC - Input Tax Credit or ITC in short, is the act of getting back/a refund on the tax you paid for an item at the time of purchase whenever you sell it to a customer (who pays the tax associated with the selling price of the same item).

ITC ledger - An Input Tax Credit ledger (ITC ledger) is a type of a subsidiary ledger maintained by a company that will keep track of the input taxes under the different components of GST (CGST, SGST, and IGST) and the input tax credits received by the company under these GST components.

P
POS - Under GST, in a sales transaction, POS or Place of Supply refers to the location of the buyer of goods and/or services.
S
SAC - The SAC or the Services Accounting Code is an method of nomenclature that will be used to identify, classify and define services under the GST.

SGST - The GST levied on an intra-state transaction (same state) has two components - CGST and SGST. The SGST or the State Goods and Services Tax is the state component of GST that subsumes all indirect taxes collected by different states of India (e.g.: State VAT, Luxury tax etc.). The tax collected under this component becomes the revenue for the state government.

T
TDS - Tax Deducted at Source is a method of collecting income tax. This is done by having an organization/authorized person deduct tax on services they hire and pay this tax on behalf of those service providers (who will in turn get credit on income tax). If you deduct tax at source then the tax associated with such transactions have to be recorded and tracked under the GSTR-7 (this return has to be filed by you monthly).
U
UIN - An UIN or Unique Identity Number is an ID that is used to identify specialized agencies who are non-taxable on Indian soil. These agencies can be bodies of United Nations, consulates, foreign embassies or organizations that are exempted either by the UN or by our government(s).

UQC - The Unit Quantity Code is an item code that is prescribed for every imported or exported item by the Customs authority according to the Customs Tariff Act 1975. This code should be mentioned on all Bills of Entry and Shipping Bills.